zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/LPC55S36/LPC55S36_COMMON.h
/* PUF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PUF base address */
  #define PUF_BASE                                 (0x5003A000u)
  /** Peripheral PUF base address */
  #define PUF_BASE_NS                              (0x4003A000u)
  /** Peripheral PUF base pointer */
  #define PUF                                      ((PUF_Type *)PUF_BASE)
  /** Peripheral PUF base pointer */
  #define PUF_NS                                   ((PUF_Type *)PUF_BASE_NS)
  /** Peripheral PUF base address */
  #define PUF_ALIAS1_BASE                          (0x5003B000u)
  /** Peripheral PUF base address */
  #define PUF_ALIAS1_BASE_NS                       (0x4003B000u)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS1                               ((PUF_Type *)PUF_ALIAS1_BASE)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS1_NS                            ((PUF_Type *)PUF_ALIAS1_BASE_NS)
  /** Peripheral PUF base address */
  #define PUF_ALIAS2_BASE                          (0x5003C000u)
  /** Peripheral PUF base address */
  #define PUF_ALIAS2_BASE_NS                       (0x4003C000u)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS2                               ((PUF_Type *)PUF_ALIAS2_BASE)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS2_NS                            ((PUF_Type *)PUF_ALIAS2_BASE_NS)
  /** Peripheral PUF base address */
  #define PUF_ALIAS3_BASE                          (0x5003D000u)
  /** Peripheral PUF base address */
  #define PUF_ALIAS3_BASE_NS                       (0x4003D000u)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS3                               ((PUF_Type *)PUF_ALIAS3_BASE)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS3_NS                            ((PUF_Type *)PUF_ALIAS3_BASE_NS)
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS                           { PUF_BASE, PUF_ALIAS1_BASE, PUF_ALIAS2_BASE, PUF_ALIAS3_BASE }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS                            { PUF, PUF_ALIAS1, PUF_ALIAS2, PUF_ALIAS3 }
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS_NS                        { PUF_BASE_NS, PUF_ALIAS1_BASE_NS, PUF_ALIAS2_BASE_NS, PUF_ALIAS3_BASE_NS }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS_NS                         { PUF_NS, PUF_ALIAS1_NS, PUF_ALIAS2_NS, PUF_ALIAS3_NS }
#else
  /** Peripheral PUF base address */
  #define PUF_BASE                                 (0x4003A000u)
  /** Peripheral PUF base pointer */
  #define PUF                                      ((PUF_Type *)PUF_BASE)
  /** Peripheral PUF base address */
  #define PUF_ALIAS1_BASE                          (0x4003B000u)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS1                               ((PUF_Type *)PUF_ALIAS1_BASE)
  /** Peripheral PUF base address */
  #define PUF_ALIAS2_BASE                          (0x4003C000u)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS2                               ((PUF_Type *)PUF_ALIAS2_BASE)
  /** Peripheral PUF base address */
  #define PUF_ALIAS3_BASE                          (0x4003D000u)
  /** Peripheral PUF base pointer */
  #define PUF_ALIAS3                               ((PUF_Type *)PUF_ALIAS3_BASE)
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS                           { PUF_BASE, PUF_ALIAS1_BASE, PUF_ALIAS2_BASE, PUF_ALIAS3_BASE }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS                            { PUF, PUF_ALIAS1, PUF_ALIAS2, PUF_ALIAS3 }
#endif
/** Interrupt vectors for the PUF peripheral type */
#define PUF_IRQS                                 { PUF_IRQn }

/* PWM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PWM0 base address */
  #define PWM0_BASE                                (0x500C3000u)
  /** Peripheral PWM0 base address */
  #define PWM0_BASE_NS                             (0x400C3000u)
  /** Peripheral PWM0 base pointer */
  #define PWM0                                     ((PWM_Type *)PWM0_BASE)
  /** Peripheral PWM0 base pointer */
  #define PWM0_NS                                  ((PWM_Type *)PWM0_BASE_NS)
  /** Peripheral PWM1 base address */
  #define PWM1_BASE                                (0x500C5000u)
  /** Peripheral PWM1 base address */
  #define PWM1_BASE_NS                             (0x400C5000u)
  /** Peripheral PWM1 base pointer */
  #define PWM1                                     ((PWM_Type *)PWM1_BASE)
  /** Peripheral PWM1 base pointer */
  #define PWM1_NS                                  ((PWM_Type *)PWM1_BASE_NS)
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS                           { PWM0_BASE, PWM1_BASE }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS                            { PWM0, PWM1 }
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS_NS                        { PWM0_BASE_NS, PWM1_BASE_NS }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS_NS                         { PWM0_NS, PWM1_NS }
#else
  /** Peripheral PWM0 base address */
  #define PWM0_BASE                                (0x400C3000u)
  /** Peripheral PWM0 base pointer */
  #define PWM0                                     ((PWM_Type *)PWM0_BASE)
  /** Peripheral PWM1 base address */
  #define PWM1_BASE                                (0x400C5000u)
  /** Peripheral PWM1 base pointer */
  #define PWM1                                     ((PWM_Type *)PWM1_BASE)
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS                           { PWM0_BASE, PWM1_BASE }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS                            { PWM0, PWM1 }
#endif
/** Interrupt vectors for the PWM peripheral type */
#define PWM_CMP_IRQS                             { { FLEXPWM0_COMPARE0_IRQn, FLEXPWM0_COMPARE1_IRQn, FLEXPWM0_COMPARE2_IRQn, FLEXPWM0_COMPARE3_IRQn }, { FLEXPWM1_COMPARE0_IRQn, FLEXPWM1_COMPARE1_IRQn, FLEXPWM1_COMPARE2_IRQn, FLEXPWM1_COMPARE3_IRQn } }
#define PWM_RELOAD_IRQS                          { { FLEXPWM0_RELOAD0_IRQn, FLEXPWM0_RELOAD1_IRQn, FLEXPWM0_RELOAD2_IRQn, FLEXPWM0_RELOAD3_IRQn }, { FLEXPWM1_RELOAD0_IRQn, FLEXPWM1_RELOAD1_IRQn, FLEXPWM1_RELOAD2_IRQn, FLEXPWM1_RELOAD3_IRQn } }
#define PWM_CAPTURE_IRQS                         { { FLEXPWM0_CAPTURE_IRQn, FLEXPWM0_CAPTURE_IRQn, FLEXPWM0_CAPTURE_IRQn, FLEXPWM0_CAPTURE_IRQn }, { FLEXPWM1_CAPTURE_IRQn, FLEXPWM1_CAPTURE_IRQn, FLEXPWM1_CAPTURE_IRQn, FLEXPWM1_CAPTURE_IRQn } }
#define PWM_FAULT_IRQS                           { FLEXPWM0_FAULT_IRQn, FLEXPWM1_FAULT_IRQn }
#define PWM_RELOAD_ERROR_IRQS                    { FLEXPWM0_RELOAD_ERROR_IRQn, FLEXPWM1_RELOAD_ERROR_IRQn }

/* RTC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RTC base address */
  #define RTC_BASE                                 (0x5002C000u)
  /** Peripheral RTC base address */
  #define RTC_BASE_NS                              (0x4002C000u)
  /** Peripheral RTC base pointer */
  #define RTC                                      ((RTC_Type *)RTC_BASE)
  /** Peripheral RTC base pointer */
  #define RTC_NS                                   ((RTC_Type *)RTC_BASE_NS)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { RTC_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { RTC }
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS_NS                        { RTC_BASE_NS }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS_NS                         { RTC_NS }
#else
  /** Peripheral RTC base address */
  #define RTC_BASE                                 (0x4002C000u)
  /** Peripheral RTC base pointer */
  #define RTC                                      ((RTC_Type *)RTC_BASE)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { RTC_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { RTC }
#endif
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { RTC_IRQn }

/* S50 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ELS base address */
  #define ELS_BASE                                 (0x50030000u)
  /** Peripheral ELS base address */
  #define ELS_BASE_NS                              (0x40030000u)
  /** Peripheral ELS base pointer */
  #define ELS                                      ((S50_Type *)ELS_BASE)
  /** Peripheral ELS base pointer */
  #define ELS_NS                                   ((S50_Type *)ELS_BASE_NS)
  /** Peripheral ELS base address */
  #define ELS_ALIAS1_BASE                          (0x50031000u)
  /** Peripheral ELS base address */
  #define ELS_ALIAS1_BASE_NS                       (0x40031000u)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS1                               ((S50_Type *)ELS_ALIAS1_BASE)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS1_NS                            ((S50_Type *)ELS_ALIAS1_BASE_NS)
  /** Peripheral ELS base address */
  #define ELS_ALIAS2_BASE                          (0x50032000u)
  /** Peripheral ELS base address */
  #define ELS_ALIAS2_BASE_NS                       (0x40032000u)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS2                               ((S50_Type *)ELS_ALIAS2_BASE)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS2_NS                            ((S50_Type *)ELS_ALIAS2_BASE_NS)
  /** Peripheral ELS base address */
  #define ELS_ALIAS3_BASE                          (0x50033000u)
  /** Peripheral ELS base address */
  #define ELS_ALIAS3_BASE_NS                       (0x40033000u)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS3                               ((S50_Type *)ELS_ALIAS3_BASE)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS3_NS                            ((S50_Type *)ELS_ALIAS3_BASE_NS)
  /** Array initializer of S50 peripheral base addresses */
  #define S50_BASE_ADDRS                           { ELS_BASE, ELS_ALIAS1_BASE, ELS_ALIAS2_BASE, ELS_ALIAS3_BASE }
  /** Array initializer of S50 peripheral base pointers */
  #define S50_BASE_PTRS                            { ELS, ELS_ALIAS1, ELS_ALIAS2, ELS_ALIAS3 }
  /** Array initializer of S50 peripheral base addresses */
  #define S50_BASE_ADDRS_NS                        { ELS_BASE_NS, ELS_ALIAS1_BASE_NS, ELS_ALIAS2_BASE_NS, ELS_ALIAS3_BASE_NS }
  /** Array initializer of S50 peripheral base pointers */
  #define S50_BASE_PTRS_NS                         { ELS_NS, ELS_ALIAS1_NS, ELS_ALIAS2_NS, ELS_ALIAS3_NS }
#else
  /** Peripheral ELS base address */
  #define ELS_BASE                                 (0x40030000u)
  /** Peripheral ELS base pointer */
  #define ELS                                      ((S50_Type *)ELS_BASE)
  /** Peripheral ELS base address */
  #define ELS_ALIAS1_BASE                          (0x40031000u)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS1                               ((S50_Type *)ELS_ALIAS1_BASE)
  /** Peripheral ELS base address */
  #define ELS_ALIAS2_BASE                          (0x40032000u)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS2                               ((S50_Type *)ELS_ALIAS2_BASE)
  /** Peripheral ELS base address */
  #define ELS_ALIAS3_BASE                          (0x40033000u)
  /** Peripheral ELS base pointer */
  #define ELS_ALIAS3                               ((S50_Type *)ELS_ALIAS3_BASE)
  /** Array initializer of S50 peripheral base addresses */
  #define S50_BASE_ADDRS                           { ELS_BASE, ELS_ALIAS1_BASE, ELS_ALIAS2_BASE, ELS_ALIAS3_BASE }
  /** Array initializer of S50 peripheral base pointers */
  #define S50_BASE_PTRS                            { ELS, ELS_ALIAS1, ELS_ALIAS2, ELS_ALIAS3 }
#endif

/* SCT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SCT0 base address */
  #define SCT0_BASE                                (0x50085000u)
  /** Peripheral SCT0 base address */
  #define SCT0_BASE_NS                             (0x40085000u)
  /** Peripheral SCT0 base pointer */
  #define SCT0                                     ((SCT_Type *)SCT0_BASE)
  /** Peripheral SCT0 base pointer */
  #define SCT0_NS                                  ((SCT_Type *)SCT0_BASE_NS)
  /** Array initializer of SCT peripheral base addresses */
  #define SCT_BASE_ADDRS                           { SCT0_BASE }
  /** Array initializer of SCT peripheral base pointers */
  #define SCT_BASE_PTRS                            { SCT0 }
  /** Array initializer of SCT peripheral base addresses */
  #define SCT_BASE_ADDRS_NS                        { SCT0_BASE_NS }
  /** Array initializer of SCT peripheral base pointers */
  #define SCT_BASE_PTRS_NS                         { SCT0_NS }
#else
  /** Peripheral SCT0 base address */
  #define SCT0_BASE                                (0x40085000u)
  /** Peripheral SCT0 base pointer */
  #define SCT0                                     ((SCT_Type *)SCT0_BASE)
  /** Array initializer of SCT peripheral base addresses */
  #define SCT_BASE_ADDRS                           { SCT0_BASE }
  /** Array initializer of SCT peripheral base pointers */
  #define SCT_BASE_PTRS                            { SCT0 }
#endif
/** Interrupt vectors for the SCT peripheral type */
#define SCT_IRQS                                 { SCT0_IRQn }

/* SECTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_BASE                             (0x500AC000u)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_BASE_NS                          (0x400AC000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0                                  ((SECTRL_Type *)SECTRL0_BASE)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_NS                               ((SECTRL_Type *)SECTRL0_BASE_NS)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS1_BASE                      (0x500AD000u)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS1_BASE_NS                   (0x400AD000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS1                           ((SECTRL_Type *)SECTRL0_ALIAS1_BASE)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS1_NS                        ((SECTRL_Type *)SECTRL0_ALIAS1_BASE_NS)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS2_BASE                      (0x500AE000u)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS2_BASE_NS                   (0x400AE000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS2                           ((SECTRL_Type *)SECTRL0_ALIAS2_BASE)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS2_NS                        ((SECTRL_Type *)SECTRL0_ALIAS2_BASE_NS)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS3_BASE                      (0x500AF000u)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS3_BASE_NS                   (0x400AF000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS3                           ((SECTRL_Type *)SECTRL0_ALIAS3_BASE)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS3_NS                        ((SECTRL_Type *)SECTRL0_ALIAS3_BASE_NS)
  /** Array initializer of SECTRL peripheral base addresses */
  #define SECTRL_BASE_ADDRS                        { SECTRL0_BASE, SECTRL0_ALIAS1_BASE, SECTRL0_ALIAS2_BASE, SECTRL0_ALIAS3_BASE }
  /** Array initializer of SECTRL peripheral base pointers */
  #define SECTRL_BASE_PTRS                         { SECTRL0, SECTRL0_ALIAS1, SECTRL0_ALIAS2, SECTRL0_ALIAS3 }
  /** Array initializer of SECTRL peripheral base addresses */
  #define SECTRL_BASE_ADDRS_NS                     { SECTRL0_BASE_NS, SECTRL0_ALIAS1_BASE_NS, SECTRL0_ALIAS2_BASE_NS, SECTRL0_ALIAS3_BASE_NS }
  /** Array initializer of SECTRL peripheral base pointers */
  #define SECTRL_BASE_PTRS_NS                      { SECTRL0_NS, SECTRL0_ALIAS1_NS, SECTRL0_ALIAS2_NS, SECTRL0_ALIAS3_NS }
#else
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_BASE                             (0x400AC000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0                                  ((SECTRL_Type *)SECTRL0_BASE)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS1_BASE                      (0x400AD000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS1                           ((SECTRL_Type *)SECTRL0_ALIAS1_BASE)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS2_BASE                      (0x400AE000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS2                           ((SECTRL_Type *)SECTRL0_ALIAS2_BASE)
  /** Peripheral SECTRL0 base address */
  #define SECTRL0_ALIAS3_BASE                      (0x400AF000u)
  /** Peripheral SECTRL0 base pointer */
  #define SECTRL0_ALIAS3                           ((SECTRL_Type *)SECTRL0_ALIAS3_BASE)
  /** Array initializer of SECTRL peripheral base addresses */
  #define SECTRL_BASE_ADDRS                        { SECTRL0_BASE, SECTRL0_ALIAS1_BASE, SECTRL0_ALIAS2_BASE, SECTRL0_ALIAS3_BASE }
  /** Array initializer of SECTRL peripheral base pointers */
  #define SECTRL_BASE_PTRS                         { SECTRL0, SECTRL0_ALIAS1, SECTRL0_ALIAS2, SECTRL0_ALIAS3 }
#endif

